{"intents": [
        {"tag": "greetings",
         "patterns": ["hi", 
                      "how are you", 
                      "is anyone there", 
                      "hello", 
                      "whats up",
                      "hey",
                      "yo",
                      "listen", 
                      "please help me",
                      "i belong to",
                      "aiml batch",
                      "i am from",
                      "my name is",
                      "online",
                      "i am from",
                      "hey ya",
                      "talking to you for first time"], 
					   
         "responses": ["Hello! how could i help you?",
					  "Hi there! How may i help you please?",
					  "Hello! How do you do? How could i help you today?"], 
					  
         "context_set": ""
        },
        {"tag": "sendoff",
         "patterns": ["thank you", 
                      "thanks", 
                      "cya",
					  "bye",
                      "see you",
                      "later", 
                      "see you later", 
                      "goodbye", 
                      "i am leaving", 
                      "have a Good day",
                      "you helped me",
                      "thanks a lot",
                      "thanks a ton",
                      "you are the best",
                      "great help",
                      "too good",
                      "you are a good learning buddy"],
					  
         "responses": ["I hope I was able to assist you, Good Bye"],
		 
         "context_set": ""
        },
        {"tag": "rude",
         "patterns": ["what the hell",
                      "bloody stupid bot",
                      "do you think you are very smart",
                      "screw you", 
                      "i hate you", 
                      "you are stupid",
                      "jerk",
                      "you are a joke",
                      "useless piece of shit"],
         "responses": ["Please use respectful words"],
         "context_set": ""
        },
		{"tag": "employee, polyurethane, pully, installing, impact",
		 "patterns": ["what is the accident happened to the employee while installing a segment of polyurethane pully?",
					  "what happens when the incident took place to the employee while installing a segment of pulley protective lyner?",
					  "what is the impact by this accident of installing pulley protective lyner at other industrial works?"],					  
		 "responses": ["While installing a segment of polyurethane pulley protective lyner on the head pully of the ore winch, employee rotated the pulley to compress the lyner inside the channel, When the employee rotated the pulley to compress the lyner inside the channel, it fell from its housing, rubbing the right side of the worker's hip, Fortunately it is an accident at a level of I and its potential level is of III"],
		 "context_set": ""
		},
		{"tag": "employee,auxillary,hot,hitting,crane,impact",
		 "patterns": ["how the accident occurs to employees whose work is in other industries with an auxillary wheel of cathode crane was changed?",
					  "why it happens to the employees when a piece of hot bearing is detached while hitting it with a hammer?",
					  "what is the impact to the employee by accidents of working on a hot bearing and hitting with a hammer?"],					  
		 "responses": ["When the employee heated a bearing and hit with the hammer and chisel at one end of the bearing track, a piece of bearing is detached, The employee got a cut on his right thigh and he was transferred to the hospital in an ambulance immediately, Fortunately it is an accident at a level of I and its potential level is of II"],
		 "context_set": ""
		},
		{"tag": "employee,power,cables,disconnect,industrial,impact",
		 "patterns": ["what occurs to the workers whose work is in industrial work while working with power cables?",
					  "what may happen when an employee disconnects the power cables?"],
		 "responses": ["While the employee was making a disconnection of two power cables of the gate in order to remove it, When the employee was removing the rope tied to the body of gate the warning post was pulled over and it hit the helmet of other employee who was standing at his side, Fortunately it is an accident at a level of I and its potential level is of III"],
		 "context_set": ""
		},
		{"tag": "employee,electric,coil,warehouse,forklift,beehive,disturbed,other,people,impact",
		 "patterns": ["how come an accident occur to workers working with removal of coil of electric cables in a warehouse with the help of forklift truck?",
					  "what is the situation of emploeyees and other people passing by when the beehive is disturbed?",
					  "is there any impact to the any of people by disturbing the beehive while working with coil of electric cables?"],					  
		 "responses": ["When the employee started to remove the coil of electric cables in a warehouse with the help of folklift truck, by mistake he did not notice that there was a beehive in it, When the employee realised the fact he turned off the equipment and left the area and the people passing by were stung by the bees, Fortunately it is an accident at a level of I and its potential level is of V"],
		 "context_set": ""
		},
		{"tag": "employee,inspect,Jumbo,equipment,esengrasante,toxicity,bottle,impact",
		 "patterns": ["how did the incident happened to the employee whose work is to inspect pre-use of Jumbo 15 equipment?",
					  "how did the male employee treated when he took the liquid which is in contact of esengrasante product of equipment and machinery of low toxicity?",
					  "what happens to human beings if intake of the liquid which is contaminated with an esengrasante product of equipment and machinery of low toxicity?"],					  
		 "responses": ["while the employee doing the pre-use inspection of Jumbo 15 equipment, he found a bottle without any label or labelling, he thought that it contains a liquid of mineral water, by mistake, the employee took a small sip of the liquid which is contaminated with an esengrasante product of equipment and machinery of low toxicity and expelled it immediately and washed with enough water and transferred to medical center, Fortunately it is an accident at a level of I and its potential level is of IV"],
		 "context_set": ""
		},
		{"tag": "mining,third,remote,employee,sudden,illness,impact",
		 "patterns": ["how to work a third party remote employee whose work is at mining?",
					  "what happens to the third party remote employee working at mining when he suffers sudden illness?",
					  "what is the impact to a employee who is suffering from excoriation on the face?"],					  
		 "responses": ["The employee was sitting in the resting area at level 326 raise bore, he suffered sudden illness and fell down, The employee sufferred from sudden illness and fell down, sufferred from excoriation on the face, Fortunately it is an accident at a level of I and its potential level is of IV"],
		 "context_set": ""
		},
		{"tag": "mining,loosening,trucks,cylindrical,bolt,power,steering,impact",
		 "patterns": ["what happened to employee whose work is at mining while loosening a trucks steering cylindrical bolt using power cable and socket?",
					  "how the employee handles with cylindrical bolt using power cable and socket?",
					  "any impact to the worker who works to loosen the cylindrical bolt from a steering of a truck?"],					  
		 "responses": ["While the employee was working with a truck's streering cylindrical bolt using power cable and socket, by the force caused by the equipment the bolt suddenly retired, When the employee applied force on the cylindrical bolt to loosen it from the truck's steering it came out of its position and the employee hit his hand agaist the structure of the equipment and had injury to his hand, It is an accident at a level of II and its potential level is of II"],
		 "context_set": ""
		},
		{"tag": "mining,moving,oil,cylinder,rail,track,impact,wearing,leather-type,safety,gloves",
		 "patterns": ["what is the reason for a couple of third party remote employees who is moving an oil cylinder?",
					  "why the employees wearing leather-type safety gloves and placing the mobile platform on the rail track?"],
		 "responses": ["When the two employees are preparing to move an oil cylinder on a mobile platform of about 200ks which is mounted on rails, the mobile platform derailed from the rail tracks, both the employees wore leather-type safety gloves and tried to lift the mobile platform and keep it on the rail tracks, while placing the mobile platform on the rail tracks, one of the employee's right hand got trapped between the rail and the mobile platform, At the incident of placing a mobile platform on the rail, the employee's right hand got trapped between the rail and the mobile platform and caused a bruised wound on the index finger of the right hand, fortunately there was no fracture, It is an accident at a level of III and its potential level is of IV"],
		 "context_set": ""
		},
		{"tag": "mining,mechanical,assistant,crane,descending,ladder,impact",
		 "patterns": ["what incident occurred to the third party mechanical assistant working in a crane truck?",
					  "is mechanic assistant who worked on crane truck descending from the crane using ladder?",
					  "who worked on crane truck and descending from the crane using ladder?"],					  
		 "responses": ["After throwing the wooden blocks of support of the stabilizer of the Hiab crane truck to the ground, the mechanic assistant was descending from the truck using ladder, he jumped from the last step of the ladder from 69cm, The mechanical assistant jumped from the last step of the ladder and set his left foot on the edge of one of the wooden blocks and got injured on his left ankle, It is an accident at a level of I and its potential level is of IV"],
		 "context_set": ""
		},
		{"tag": "mining,Abratech,company,putty,conditioning,tank,impact",
		 "patterns": ["who are working for Abratech company whose work is with putty inside the conditioning tank?",
					  "what happend to the worker who worked for company whose work is with putty?",
					  "what is the impact to any person who works for Abratech company?"],					  
		 "responses": ["When two workers of the Abratech company were doing putty work inside the conditioning tank, two other employees of the HyT company carried out maneuvers transfer of a pump with the help of a manual tick - which worked hooked to a beam H, dragging the pump on the metal gratings and when trying to release it, the metal grid fell inside the tank, hit a diagonal channel inside the tank, The accident impacted the right arm of one of the workers and rubs the helmet of the second worker that he was crouching, the area where the bomb was being moved was marked with tape and did not have a lookout, It is an accident at a level of I and its potential level is of V"],
		 "context_set": ""
		},
		{"tag": "metalsemployee",
         "patterns": ["What are the issues realted to volumetric balloon",
					  "accident realted to volumetric balloon",
					  "accident realted to cyclone duct",
					  "issues realted to cyclone duct",
					  "issues while cleaning the cyclone duct",
					  "accidents while cleaning the cyclone duct",
					  "obstruction on Cyclone duct",
					  "accumulation of Waelz on the conveyor",
					  "issues related to cleaning of the shutter",
					  "related to zinc",
					  "accident realted Employee in metals industry",
					  "accidents in metals industry"
					  ],
         "responses": ["Based on the historical facts it has been observed  that Employees in the Metal Industry have met with accidents related to volumetric balloon, cyclone duct, conveyor, Zinc which have result in small burns on the body parts including face as well. So it is always recommended to take proper precautions and use face and body covers while working on such areas"],
		 "context_set": ""
        },
		
		{"tag": "otherstpemployee",
         "patterns": ["issues realted to cuts",
					  "issues realted to Manetometer",
					  "accidents with Manetometer",
					  "steep slope issues ",
					  "issues while doing sleeve removal",
					  "accidents causing cuts",
					  "geological mapping activity",
					  "realted to vehicle",
					  "hammer a rock"
					],
         "responses": ["Based on the historical facts it has been observed  that Third Party Employees in Other Industry have met with accidents related to Manetometer, sleeve removal maneuver, vehicle, geological mapping activity which have result in different diferent degree of cuts due to which Employees have been Hospitalized as well. So it is always recommended to take proper precautions and use covers while working on such areas"],
		 "context_set": ""
        },
		{"tag": "escalation",
         "patterns": ["my problem is not solved", 
                      "you did not help me", 
                      "not a good solution",
                      "bad solution",
                      "not good solution",
                      "no help",
                      "wasted my time",
                      "useless bot",
                      "create a ticket"],
         "responses": ["Apologies... Tarnsferring the request to our Second Level Team..."],
         "context_set": ""
        }
		
	]
	
} 


